Revit 2027 API
BuiltInFailures.StairRampFailures.CannotDrawStairs Property
 Can't make stairs
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawStairs { get; }
Public Shared ReadOnly Property CannotDrawStairs As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawStairs {
	FailureDefinitionId^ get ();
}
static member CannotDrawStairs : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace